In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import statsmodels.api as sm

In [2]:
df = pd.read_csv('tovar_moving.csv')

In [3]:
df.head()

         date     qty
0  01.09.2009  179667
1  02.09.2009  177670
2  03.09.2009  152112
3  04.09.2009  142938
4  05.09.2009  130741

In [4]:
df['new_date'] = pd.to_datetime(df['date'])

In [5]:
df['new_date'].head()

0   2009-01-09
1   2009-02-09
2   2009-03-09
3   2009-04-09
4   2009-05-09
Name: new_date, dtype: datetime64[ns]

In [6]:
df.head()

         date     qty   new_date
0  01.09.2009  179667 2009-01-09
1  02.09.2009  177670 2009-02-09
2  03.09.2009  152112 2009-03-09
3  04.09.2009  142938 2009-04-09
4  05.09.2009  130741 2009-05-09

In [9]:
new_date_index = df.set_index('new_date')

In [10]:
df.head()

         date     qty   new_date
0  01.09.2009  179667 2009-01-09
1  02.09.2009  177670 2009-02-09
2  03.09.2009  152112 2009-03-09
3  04.09.2009  142938 2009-04-09
4  05.09.2009  130741 2009-05-09

In [11]:
year_month_summary = new_date_index.groupby(lambda x: x.year * 100 + x.month).count()

In [14]:
print year_month_summary

        date  qty
200901     4    4
200902     4    4
200903     4    4
200904     4    4
200905     4    4
200906     4    4
200907     4    4
200908     4    4
200909    22   22
200910    23   23
200911    22   22
200912    23   23
201001    31   31
201002    28   28
201003    31   31
201004    30   30
201005    31   31
201006    30   30
201007    31   31
201008    31   31
201009    30   30
201010    31   31
201011    30   30
201012    31   31
201101    31   31
201102    28   28
201103    31   31
201104    30   30
201105    31   31
201106    30   30
...      ...  ...
201111    30   30
201112    31   31
201201    31   31
201202    29   29
201203    31   31
201204    30   30
201205    31   31
201206    30   30
201207    31   31
201208    31   31
201209    30   30
201210    31   31
201211    30   30
201212    31   31
201301    31   31
201302    28   28
201303    31   31
201304    30   30
201305    31   31
201306    30   30
201307    31   31
201308    31   31
201309    30   30
201310    31   31
201311    30   30
201312    31   31
201402     1    1
201403     1    1
201404     1    1
201405     1    1

[64 rows x 2 columns]

In [15]:
year_month_summary.head()

        date  qty
200901     4    4
200902     4    4
200903     4    4
200904     4    4
200905     4    4

In [16]:
qty_count_summary = year_month_summary['qty']

In [17]:
print qty_count_summary

200901     4
200902     4
200903     4
200904     4
200905     4
200906     4
200907     4
200908     4
200909    22
200910    23
200911    22
200912    23
201001    31
201002    28
201003    31
201004    30
201005    31
201006    30
201007    31
201008    31
201009    30
201010    31
201011    30
201012    31
201101    31
201102    28
201103    31
201104    30
201105    31
201106    30
          ..
201111    30
201112    31
201201    31
201202    29
201203    31
201204    30
201205    31
201206    30
201207    31
201208    31
201209    30
201210    31
201211    30
201212    31
201301    31
201302    28
201303    31
201304    30
201305    31
201306    30
201307    31
201308    31
201309    30
201310    31
201311    30
201312    31
201402     1
201403     1
201404     1
201405     1
Name: qty, dtype: int64

In [19]:
sm.graphics.tsa.plot_acf(qty_count_summary)
plt.show()

In [20]:
sm.graphics.tsa.plot_pacf(qty_count_summary)
plt.show()